/** 矢倉の定跡 (KIF形式サンプル) */
export const SAMPLE_KIF_YAGURA = `# ---- Kifu for Windows V7 V7.62 棋譜ファイル ----
開始日時：2024/01/01 00:00:00
手合割：平手
先手：先手
後手：後手
手数----指手---------消費時間--
   1 ７六歩(77)
   2 ８四歩(83)
   3 ２六歩(27)
   4 ８五歩(84)
   5 ７七角(88)
   6 ３四歩(33)
   7 ６六歩(67)
   8 ６二銀(71)
   9 ６八銀(79)
  10 ４三銀(32)
  11 ５六歩(57)
  12 ３二金(41)
  13 ４八銀(39)
  14 ４一玉(51)
  15 ５七銀(48)
  16 ３三銀(43)
  17 ６七銀(57)
  18 ３一玉(41)
  19 ７八金(69)
  20 ４四歩(43)
  21 ６九玉(59)
  22 ４三金(32)
  23 ７九玉(69)
  24 ６四歩(63)
  25 ８八玉(79)
  26 ７四歩(73)
  27 ５八金(49)
  28 ７三桂(81)
  29 ６八金右(58)
  30 ６三銀(62)
  31 ７九銀(68)
  32 ５二玉(31)
  33 ６八銀(79)
  34 ４二玉(52)
  35 ７九角(77)
  36 ３二玉(42)
  37 ２五歩(26)
  38 ２二角(22)
  39 ３六歩(37)
  40 ４一金(43)
`;

/** 振り飛車 (KIF形式サンプル) */
export const SAMPLE_KIF_FURIBISHA = `# ---- Kifu for Windows ----
手合割：平手
先手：先手
後手：後手
手数----指手---------消費時間--
   1 ７六歩(77)
   2 ３四歩(33)
   3 ２六歩(27)
   4 ４四歩(43)
   5 ２五歩(26)
   6 ３三角(22)
   7 ７八金(69)
   8 ３二飛(82)
   9 ３八銀(39)
  10 ４三銀(32)
  11 ２七銀(38)
  12 ６二玉(51)
  13 ３六銀(27)
  14 ７二玉(62)
  15 ６八玉(59)
  16 ８二玉(72)
  17 ７九玉(68)
  18 ４二金(31)
  19 ８八玉(79)
  20 ５二金(41)
`;
